{
  "page": 1,
  "page_count": 1019,
  "items_per_page": 20,
  "took": 8,
  "timed_out": false,
  "total": 20369,
  "results": [
    {
      "contents": "<p>Looking to work at a firm with an unbeatable culture? </p>\n\n<p>Withum is a forward-thinking, technology-driven advisory and accounting firm, helping clients to Be in a Position of StrengthSM in today’s modern business landscape. Withum empowers clients with innovative tools and solutions to address their accounting, tax and overall business management needs. Withum is a place where talent thrives. We recruit only the best and brightest people, with a genuine passion for the business. </p>\n\n<p>Withum is currently seeking a <strong>Temporary Campus Recruiter</strong> to join one of our <strong>New England or Florida offices (Boston, MA; Braintree, MA; Woburn, MA; or Providence, RI; Orlando, FL; Boca Raton, FL) </strong>to support our growing team. This will be a <strong>hybrid </strong>position. In this role, you will be responsible for the recruitment of college students and recent graduates for internships and entry level positions. This temporary position will begin approximately in <strong>January, 2024</strong> and will conclude approximately in<strong> July 2024.</strong></p>\n\n<p>Withum’s brand is a reflection of our people, our culture and our strength. Withum has become synonymous with teamwork and client service excellence. The cornerstone of our success can truly be accredited to the dedicated professionals who work here every day, whose mission is to help our clients grow and thrive - to be in a position of strength. But our commitment goes beyond our clients as we continue to live the Withum Way, promoting personal and professional growth for all team members, clients, and surrounding communities.</p>\n\n<p><strong>How You’ll Spend Your Time:</strong></p>\n\n<ul>\n<li>Coordinating/attending college career fairs and other events to attract and engage with students</li>\n<li>Hosting on campus information sessions to promote the Withum Brand</li>\n<li>Building and fostering relationships with university career services, student organizations and other campus resources</li>\n<li>Screening resumes, conducting interviews and presenting candidate offers</li>\n<li>Developing a strong pipeline of candidates through passive and active sourcing using social media, university events, and other recruitment platforms</li>\n<li>Planning and participating in internship and leadership programs</li>\n<li>Creating and executing internal recruitment campaigns to encourage client service professionals to actively participate in recruitment events</li>\n<li>Analyzing and tracking recruiting data, including ROI of campus recruiting efforts and propose recommendations to support campus recruitment goals</li>\n<li>Designing presentations and promotional materials for use on college campuses</li>\n</ul>\n\n<p><strong>The Kinds of People We Want to Talk to:</strong></p>\n\n<ul>\n<li>Bachelor’s degree in Business Administration, HR or related field</li>\n<li>Minimum of 1-3 years campus recruitment experience within public accounting, legal, or a professional services firm</li>\n<li>Highly capable with managing the full life cycle of the campus recruitment process</li>\n<li>Possess exceptional written and verbal communication skills</li>\n<li>Self-starter with the ability to prioritize and be flexible in a constantly changing work environment</li>\n<li>A team player with a strong work ethic</li>\n<li>Excellent organization and leadership skills</li>\n<li>Must be legally authorized to work in the United States without the need for employer sponsorship, now or at any time in the future</li>\n</ul>\n\n<p> </p>\n\n<p>Withum will not discriminate against any employee or applicant for employment because of race, color, religion, sex, sexual orientation, gender identity, national origin, age, marital status, genetic information, disability or because they are a protected veteran.</p>\n\n<p>#LI-MS1</p>\n\n<p>#LI-Hybrid</p>\n\n<p> </p>",
      "name": "Temporary Campus Recruiter",
      "type": "external",
      "publication_date": "2023-12-20T10:04:50Z",
      "short_name": "temporary-campus-recruiter",
      "model_type": "jobs",
      "id": 13141314,
      "locations": [
        {
          "name": "Boca Raton, FL"
        },
        {
          "name": "Boston, MA"
        },
        {
          "name": "Braintree, MA"
        },
        {
          "name": "Orlando, FL"
        },
        {
          "name": "Providence, RI"
        },
        {
          "name": "Woburn, MA"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/withumsmithbrown/temporary-campus-recruiter"
      },
      "company": {
        "id": 15000207,
        "short_name": "withumsmithbrown",
        "name": "WithumSmith+Brown"
      }
    },
    {
      "contents": "<p><b>Job Description:</b><br><br><b>Job Title: Collateral Operations Analyst  </b><br><br><b>Corporate Title: Officer</b><br><br><b>Location: Chester </b><br><br><b>Company Overview: </b><br><br>At Bank of America, we are guided by a common purpose to help make financial lives better through the power of every connection. Responsible Growth is how we run our company and how we deliver for our clients, teammates, communities, and shareholders every day.<br><br>One of the keys to driving Responsible Growth is being a great place to work for our teammates around the world. We're devoted to being a diverse and inclusive workplace for everyone. We hire individuals with a broad range of backgrounds and experiences and invest heavily in our teammates and their families by offering competitive benefits to support their physical, emotional, and financial well-being.<br><br>Bank of America believes both in the importance of working together and offering flexibility to our employees. We use a multi-faceted approach for flexibility, depending on the various roles in our organization.<br><br>Working at Bank of America will give you a great career with opportunities to learn, grow and make an impact, along with the power to make a difference. Join us!<br><br><b>Location: Chester </b><br><br>Be part of something special at Bank of America Chester. Part of a leading global financial institution, we are looking for high potential individuals to join us in driving our people forward. Bank of America Chester is an exciting, diverse workplace where we are committed to delivering a great client experience to the businesses and individuals who call Chester home. Join our team today and find a rewarding, global career.<br><br><b>Role Description:</b><br><br>An exciting opportunity has become available within the Collateral Operations Unit. The main function of the Collateral Operations unit is to mitigate exposure to counterparty risk on OTC derivative trades. You will be a team member of the Collateral Operations Unit, which monitors daily margin for customers across various products (Rates, Commodity, Structured Credit, Equity, and Foreign Exchange).<br><br><b>Responsibilities Include:</b><br><br><ul><li>You will interact with a variety of different groups within the bank:</li></ul><ul><li>Back Office/Middle office Operations</li><li>Corporate Treasury/Global Securities Operations - Determines collateral allocation and delivery of securities.</li><li>Cash/Wire Transfer - Send/receive cash collateral.</li><li>Marketers/Traders - Trade and market derivatives with Financial Institutions and Corporate Customers</li><li>Credit - Monitors credit exposure on derivative</li><li>Capital Markets Documentation - Negotiates the collateral agreements.</li></ul><ul><li>You will investigate mark discrepancies, maintain current procedure manuals, and look for methods of improving efficiency.</li></ul><br><b>What we are looking for:</b><br><br><ul><li>You will have a basic understanding of financial markets and derivative products. </li><li>You will have a basic understanding of financial markets documentation (ISDA, IFEMA, PSA) </li><li>You will have a college degree or related experience.</li><li>You will be detail oriented - Specifically the ability to recognize unusual flows/triggers for collateral in agreements and new trade structures. </li></ul><br><b>Additional Skills:</b><br><br><ul><li>An open flow of communication, specifically relating to new issues or problems, is necessary between team members. </li><li>Basic Excel skills </li><li>Ability to meet deadlines, handle high pressure situations, and juggle multiple tasks.</li></ul><br><b>Benefits of working at Bank of America</b><br><b>Ireland</b><br><br><ul><li>Private healthcare for you and your family plus an annual health screen to help you manage your physical wellness with the option to purchase a screen for your partner</li><li>Competitive pension plan, life assurance and group income protection cover if you become unable to work because of a disability or health reasons</li><li>20 days of back-up childcare including virtual tutoring and 20 days of adult-care per annum</li><li>Ability to change your core benefits as well as the option of selecting a variety of flexible benefits to suit your personal circumstances including access to a wellbeing account, travel insurance, specified illness cover etc</li><li>Use of a flex fund to use towards benefits</li><li>Access to free counselling through an Employee Assistance Programme and virtual GP services</li><li>Opportunity to donate to charities of your choice directly through payroll and the bank will match your contribution</li><li>Opportunity to join our Arts &amp; Culture corporate membership programme and receive discounted entry to some of the UK and Ireland's most iconic cultural institutions</li><li>Opportunity to give back to your community, develop new skills and work with new groups of people by volunteering in your local area</li></ul><br><b>Bank of America</b><br><br>Good conduct and sound judgment is crucial to our long term success. It's important that all employees in the organisation understand the expected standards of conduct and how we manage conduct risk. Individual accountability and an ownership mind-set are the cornerstones of our Code of Conduct and are at the heart of managing risk well.<br><br>We are an equal opportunities employer and ensure that no applicant is subject to less favourable treatment on the grounds of sex, gender identity or gender reassignment, marital or civil partner status, race, religion or belief, colour, nationality, ethnic or national origins, age, sexual orientation, pregnancy or maternity, socio-economic background, responsibility for dependants or physical or mental disability. The Bank selects candidates for interview based on their skills, qualifications and experience.<br><br>We strive to ensure that our recruitment processes are accessible for all candidates and encourage any candidates to tell us about any adjustment requirements.</p>",
      "name": "Collateral Operations Analyst  ",
      "type": "external",
      "publication_date": "2023-12-14T00:19:54Z",
      "short_name": "collateral-operations-analyst",
      "model_type": "jobs",
      "id": 13446079,
      "locations": [
        {
          "name": "Chester, United Kingdom"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/bankofamerica/collateral-operations-analyst"
      },
      "company": {
        "id": 12145,
        "short_name": "bankofamerica",
        "name": "Bank of America"
      }
    },
    {
      "contents": "<p><b>Job Description:</b><br><br><b>Job Title: </b>Senior Operations Associate - AML/KYC Refresh<br><br><b>Corporate Title: </b>Assistant Vice President<br><br><b>Location:  </b>Bromley<br><br><b>Company Overview: </b><br><br>At Bank of America, we are guided by a common purpose to help make financial lives better through the power of every connection.  Responsible Growth is how we run our company and how we deliver for our clients, teammates, communities and shareholders every day.<br><br>One of the keys to driving Responsible Growth is being a great place to work for our teammates around the world. We're devoted to being a diverse and inclusive workplace for everyone. We hire individuals with a broad range of backgrounds and experiences and invest heavily in our teammates and their families by offering competitive benefits to support their physical, emotional, and financial well-being.<br><br>Bank of America believes both in the importance of working together and offering flexibility to our employees. We use a multi-faceted approach for flexibility, depending on the various roles in our organization.<br><br>Working at Bank of America will give you a great career with opportunities to learn, grow and make an impact, along with the power to make a difference. Join us!<br><br><b>Location Overview:</b><br><br>Join our bustling Bromley office, situated in one of London's greenest boroughs. Here you'll find plentiful and easy commuting routes, with central London just 15 minutes away by train.<br><br><b>Role Description:</b><br><br>Anti-Money Laundering (AML) Know Your Customer/Client Due Diligence (KYC/CDD) is part of the Global Operations organisation and is responsible for client AML/KYC refresh globally. The team supports the business in completing AML/KYC due diligence checks as well as maintaining client records.<br><br><b>Responsibilities:</b><br><br><ul><li>You will provide technical and analytical support in a global market's operations function.</li><li>You will be responsible for the analysis and resolution of complex operations problems and initiatives requiring exceptional handling.</li><li>You may manage projects and/or the introduction of new initiatives, systems, products/services and processes, coordinating necessary expertise across multiple operations functions and/or products.</li><li>As a technical expert, you may also function as an informal team lead, providing work direction and technical guidance.</li><li>You will consult on a wide variety of topics across functional and business support lines.</li><li>You will conduct client due diligence (CDD) and enhanced due diligence (ECDD) in accordance with internal policies, procedures and regulatory guidelines aligned to more complex Jurisdictions and/or client structures.</li><li>You will review of refresh requirements for assigned jurisdiction in line with related Client Identification Profile (CIP)/CDD Procedures to ensure adequacy and accuracy before the requirements are sent to the client.</li></ul><br><b>What we are looking for:</b><br><br><ul><li>Financial services experience is essential</li><li>Documented experience performing in a process-oriented production environment that changes periodically</li><li>You will have to be Familiar with MS Office Suite (Excel/Word/Outlook/Access)</li></ul><br><b>Skills that will help: </b><br><br><ul><li>Anti-Money Laundering (AML) Know Your Customer/Client Due Diligence (KYC/CDD) experience desired but not required</li><li>Working in a team environment would be a plus</li><li>Meeting tight deadlines while ensuring data accuracy and integrity would be advantageous</li><li>Working and executing with minimal supervision or remote management would be ideal</li></ul><br><b>Benefits of working at Bank of America</b><br><br><b>UK</b><br><br><ul><li>Private healthcare for you and your family plus an annual health screen to help you manage your physical wellness with the option to purchase a screen for your partner</li><li>Competitive pension plan, life assurance and group income protection cover if you become unable to work as a result of a disability or health reasons</li><li>20 days of back-up childcare including virtual tutoring and 20 days of back-up adult care per annum</li><li>The ability to change your core benefits as well as the option of selecting a variety of flexible benefits to suit your personal circumstances including access to a wellbeing account, travel insurance, critical illness etc</li><li>Use of a flex fund to use towards benefits</li><li>Access to an emotional wellbeing helpline, mental health first aiders and virtual GP services</li><li>Ability to donate to charities of your choice directly through payroll and the bank will match your contribution</li><li>Opportunity to access our Arts &amp; Culture corporate membership programme and receive discounted entry to some of the UK and Ireland's most iconic cultural institutions</li><li>Opportunity to give back to your community, develop new skills and work with new groups of people by volunteering in your local area</li></ul><br><b>Bank of America</b><br><br>Good conduct and sound judgment is crucial to our long term success. It's important that all employees in the organisation understand the expected standards of conduct and how we manage conduct risk. Individual accountability and an ownership mind-set are the cornerstones of our Code of Conduct and are at the heart of managing risk well.<br><br>We are an equal opportunities employer, and ensure that no applicant is subject to less favourable treatment on the grounds of gender, gender identity, marital status, race, colour, nationality, ethnic or national origins, age, sexual orientation, socio-economic background, responsibilities for dependents, physical or mental disability. The Bank selects candidates for interview based on their skills, qualifications and experience.<br><br>We strive to ensure that our recruitment processes are accessible for all candidates and encourage any candidates to tell us about any adjustment requirements.<br><br>Multiple openings. Role may also fill as Ops Sr Analyst MKTS (Officer or AVP)</p>",
      "name": "Senior Operations Associate - AML/KYC Refresh",
      "type": "external",
      "publication_date": "2023-11-27T23:19:18Z",
      "short_name": "senior-operations-associate-amlkyc-refresh-f867c5",
      "model_type": "jobs",
      "id": 12197445,
      "locations": [
        {
          "name": "Orpington, United Kingdom"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/bankofamerica/senior-operations-associate-amlkyc-refresh-f867c5"
      },
      "company": {
        "id": 12145,
        "short_name": "bankofamerica",
        "name": "Bank of America"
      }
    },
    {
      "contents": "<p>DoD SkillBridge Internship - Technical Sales - Bellevue, WA<br><br>This opportunity is unique to active-duty US Military Service members with formal approval to participate in a SkillBridge Internship with our Technical Sales Group, in collaboration with Vets2PM's authorized DoD SkillBridge program<br><br>About our Smart Buildings:<br><br>Because we spend 90% of our lives in buildings, they should be perfect places for all we do. Smart buildings enhance the experience. Interacting with people, systems, and ambient elements, they learn from experience and real-time input. Using intelligent control, security, and energy management systems, we help factories and offices better support the industries they house. We help schools, hospitals, data centers, and military bases have a great impact - all while increasing comfort, efficiency, resilience, and safety. Our Smart Buildings help to create efficient, safe, responsive, and responsible environments. Our aim isn't just about improving buildings; it's about creating perfect places that improve peoples' lives.<br><br>&gt;&gt;Lean more about Siemens Smart Buildings<br><br>Our Business Unit you would be assigned to:<br><br>Building Automation:  HVAC Controls, Lighting Controls, and Mechanical/Electrical Services<br><br>Lead the charge as a member of our Smart Infrastructure Solutions &amp; Service Sales Team:<br><br>As a SkillBridge Intern in our Sales Development career track, you will play an integral part in supporting the sales and marketing efforts of a world-class, innovation powerhouse whose products and services are considered market leaders in a variety of key categories.  By developing go-to-market strategies and sales/production forecasts when using world-class CRM tools to generate estimates and custom proposals, you'll gain invaluable hands-on experience leading to a rewarding future selling Siemens' products, solutions and services to construction, industrial, and business clients.<br><br>Our Sales Development SkillBridge Interns will develop a comprehensive understanding of the marketplace, competitor offerings, customers, and decision influencers across the region. Using your technical expertise, along with your critical thinking skills, you will help tailor our solutions/service offerings to local contractors as well as existing and new end-user customers.<br><br>Your responsibilities may include:<br><br><ul><li>Working under the guidance of experienced Sales Executives and in conjunction with our operations team</li><li>Developing knowledge of Siemens products, technology, personnel, culture, policies, practices and regulations</li></ul><br><br><ul><li>Understanding the rich history of Siemens, business units, and associated products</li><li>Learning about the industry/channel/market</li><li>Training on core selling skills and confirmed methodologies to develop basic sales techniques to sell products/services/solutions to established or prospective customers</li><li>Learning key sales processes and tools</li><li>Establishing internal/external contacts</li></ul><br><br><ul><li>Completing structured on-the-job activities in job documentation, system design and installation and estimating</li><li>Shadowing a Solutions or Service Technician to gain deep hands-on understanding of our highly technical products as they relate to the customer experience</li><li>Providing support through estimations, credit checks, market research, etc.</li><li>Interacting with our global engineering team</li></ul><br>For 180-day Internships, responsibilities may include:<br><br><ul><li>Under senior guidance, managing and expanding your assigned territory</li><li>Call on prospective/established customers, providing technical and administrative product information and/or demonstration</li><li>Team-sell with colleagues as appropriate</li><li>Perform needs assessments and develop sales proposals, estimates, specifications and presentations</li><li>Work with operations, finance, legal and other internal and external clients as needed to obtain the sale</li></ul><br><br><ul><li>Begin integrating your new skills to reach target sales goals</li><li>Follow through on sold projects to ensure satisfactory completion</li></ul><br>Qualifications:<br><br><ul><li>U.S. Military experience as an E4 or above (Navy, Air Force, Army, Marines, Coast Guard, Space Force, National Guard, Reserves)</li><li>High school diploma or state-recognized GED required; Associates or Bachelor's degree preferred</li></ul><br><br><ul><li>Knowledge of Building Automation Controls, Fire/Life Safety or Security systems, business operations, and job financial reports preferred</li><li>Ability to read/interpret electrical circuit diagrams is a plus</li><li>Microsoft Office and Microsoft Project experience preferred</li><li>Qualified applicants must be legally authorized for employment in the United States</li><li>Must be 21 years of age and possess a valid driver's license with limited violations</li></ul><br>This position may support Siemens' customers who require all employees and vendors to be fully vaccinated against COVID-19 where permitted by applicable law and in accordance with an accommodation based on legally protected reasons. <br><br>Why work for Siemens as a SkillBridge Intern?<br><br>You will gain hands-on experience during your internship and will have the opportunity to join (upon successful completion of the internship) one of the world's largest and best-known companies as acknowledged in 2022 by:<br><br>Fortune: World's Most Admired Companies<br><br>Forbes: America's Best Large Employers, America's Best Employers for Diversity, and Best Employers for New Graduates<br><br>Fast Company: Most Innovative Companies and World Changing Ideas Awards<br><br>Corporate Equality Index: Best Places to Work for LGBTQ+ Equality<br><br>We offer our full-time employees (post-SkillBridge) an excellent benefits/compensation package, growth/learning/development opportunities, and a diverse/inclusive culture where everyone plays their part and makes an impact for our team and our customers.<br><br>#RSS   #LI-KJI<br><br><b>Organization:</b> Smart Infrastructure<br><br><b>Company:</b> Siemens Industry, Inc.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>",
      "name": "DOD SkillBridge Internship - Technical Sales - Seattle, WA",
      "type": "external",
      "publication_date": "2023-04-29T23:35:09Z",
      "short_name": "dod-skillbridge-internship-technical-sales-seattle-wa",
      "model_type": "jobs",
      "id": 11276527,
      "locations": [
        {
          "name": "Bellevue, WA"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Internship",
          "short_name": "internship"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/siemens/dod-skillbridge-internship-technical-sales-seattle-wa"
      },
      "company": {
        "id": 11913,
        "short_name": "siemens",
        "name": "Siemens"
      }
    },
    {
      "contents": "<p><b>Job Description:</b><br><br>At Bank of America, we are guided by a common purpose to help make financial lives better through the power of every connection. Responsible Growth is how we run our company and how we deliver for our clients, teammates, communities and shareholders every day.<br><br>One of the keys to driving Responsible Growth is being a great place to work for our teammates around the world. We're devoted to being a diverse and inclusive workplace for everyone. We hire individuals with a broad range of backgrounds and experiences and invest heavily in our teammates and their families by offering competitive benefits to support their physical, emotional, and financial well-being.<br><br>Bank of America believes both in the importance of working together and offering flexibility to our employees. We use a multi-faceted approach for flexibility, depending on the various roles in our organization.<br><br>Working at Bank of America will give you a great career with opportunities to learn, grow and make an impact, along with the power to make a difference. Join us!<br><br>Job Description:<br>This role is responsible for engaging clients in the lobby to educate and assist with conducting transactions through self-service resources such as mobile banking, online banking, or ATM. This role also accurately and efficiently processes cash transactions for clients as needed. Relationship bankers have deep conversations with clients to gain in-depth knowledge of their financial and life priorities.<br><br>A Relationship Banker (responsibilities):<br>•  Executes the bank's risk culture and strives for operational excellence<br>•  Builds relationships with individual clients to meet their financial needs<br>•  Follows established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations<br>•  Grows business knowledge and network by partnering with experts in small business, lending and investments<br>•  Manages financial center traffic, appointments and outbound calls effectively<br>•  Drives the client experience<br>•  Manages cash responsibilities<br><br>You're a person who (required skills):<br>•  Is an enthusiastic, highly motivated self-starter with a strong work ethic and intense focus on results, acting in the best interest of the client.<br>•  Collaborates effectively to get things done, building and nurturing strong relationships.<br>•  Displays passion, commitment and drive to deliver an experience that improves our clients' financial lives.<br>•  Is confident in identifying solutions for new and existing clients based on their needs.<br>•  Communicates effectively and confidently, and is comfortable engaging all clients.<br>•  Has the ability to learn and adapt to new information and technology platforms.<br>•  Is confident in educating clients on how to conduct simple banking transactions through self-service technologies (for example, ATM, online banking, mobile banking).<br>•  Applies strong critical thinking and problem-solving skills to meet clients' needs.<br>•  Will follow established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations.<br>•  Efficiently manages your time and capacity.<br>•  Focuses on results, while acting in the best interest of the client.<br>•  Can be flexible to work weekends and/or extended hours as needed.<br><br>You'll be more prepared if you have (desired skills):<br>•  Experience in financial services and knowledge of financial services industry, products and solutions.<br>•  One year of demonstrated successful sales experience in a salary plus incentive environment with individual sales goals.<br>•  Six months of cash handling experience.<br>•  Bachelor's degree or business relevant associate degree such as business management, business administration, or finance.<br><br>Skills Used in this Role:<br>•  Customer Service<br>•  Risk Management<br>•  Consumer Products and Solutions<br>•  Overcoming Objections<br>•  Risk Management<br>•  Cash Management<br>•  Demonstrating Technology<br>•  Relationship Management<br>•  Active Listening<br>•  Learning Agility<br>•  Problem Solving<br>•  Critical Thinking<br>•  Multitasking<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>",
      "name": "Relationship Banker",
      "type": "external",
      "publication_date": "2023-12-12T23:39:29Z",
      "short_name": "relationship-banker-1ec46b",
      "model_type": "jobs",
      "id": 13394923,
      "locations": [
        {
          "name": "Santa Monica, CA"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/bankofamerica/relationship-banker-1ec46b"
      },
      "company": {
        "id": 12145,
        "short_name": "bankofamerica",
        "name": "Bank of America"
      }
    },
    {
      "contents": "<p><b>Job Description:</b><br><br>At Bank of America, we are guided by a common purpose to help make financial lives better through the power of every connection. Responsible Growth is how we run our company and how we deliver for our clients, teammates, communities and shareholders every day.<br><br>One of the keys to driving Responsible Growth is being a great place to work for our teammates around the world. We're devoted to being a diverse and inclusive workplace for everyone. We hire individuals with a broad range of backgrounds and experiences and invest heavily in our teammates and their families by offering competitive benefits to support their physical, emotional, and financial well-being.<br><br>Bank of America believes both in the importance of working together and offering flexibility to our employees. We use a multi-faceted approach for flexibility, depending on the various roles in our organization.<br><br>Working at Bank of America will give you a great career with opportunities to learn, grow and make an impact, along with the power to make a difference. Join us!<br><br>Job Description:<br>This role is responsible for engaging clients in the lobby to educate and assist with conducting transactions through self-service resources such as mobile banking, online banking, or ATM. This role also accurately and efficiently processes cash transactions for clients as needed. Relationship bankers have deep conversations with clients to gain in-depth knowledge of their financial and life priorities.<br><br>A Relationship Banker (responsibilities):<br>•  Executes the bank's risk culture and strives for operational excellence<br>•  Builds relationships with individual clients to meet their financial needs<br>•  Follows established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations<br>•  Grows business knowledge and network by partnering with experts in small business, lending and investments<br>•  Manages financial center traffic, appointments and outbound calls effectively<br>•  Drives the client experience<br>•  Manages cash responsibilities<br><br>You're a person who (required skills):<br>•  Is an enthusiastic, highly motivated self-starter with a strong work ethic and intense focus on results, acting in the best interest of the client.<br>•  Collaborates effectively to get things done, building and nurturing strong relationships.<br>•  Displays passion, commitment and drive to deliver an experience that improves our clients' financial lives.<br>•  Is confident in identifying solutions for new and existing clients based on their needs.<br>•  Communicates effectively and confidently, and is comfortable engaging all clients.<br>•  Has the ability to learn and adapt to new information and technology platforms.<br>•  Is confident in educating clients on how to conduct simple banking transactions through self-service technologies (for example, ATM, online banking, mobile banking).<br>•  Applies strong critical thinking and problem-solving skills to meet clients' needs.<br>•  Will follow established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations.<br>•  Efficiently manages your time and capacity.<br>•  Focuses on results, while acting in the best interest of the client.<br>•  Can be flexible to work weekends and/or extended hours as needed.<br><br>You'll be more prepared if you have (desired skills):<br>•  Experience in financial services and knowledge of financial services industry, products and solutions.<br>•  One year of demonstrated successful sales experience in a salary plus incentive environment with individual sales goals.<br>•  Six months of cash handling experience.<br>•  Bachelor's degree or business relevant associate degree such as business management, business administration, or finance.<br><br>Skills Used in this Role:<br>•  Customer Service<br>•  Risk Management<br>•  Consumer Products and Solutions<br>•  Overcoming Objections<br>•  Risk Management<br>•  Cash Management<br>•  Demonstrating Technology<br>•  Relationship Management<br>•  Active Listening<br>•  Learning Agility<br>•  Problem Solving<br>•  Critical Thinking<br>•  Multitasking<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>",
      "name": "Relationship Banker - Allentown South Financial Center",
      "type": "external",
      "publication_date": "2023-12-14T00:19:54Z",
      "short_name": "relationship-banker-allentown-south-financial-center",
      "model_type": "jobs",
      "id": 12732783,
      "locations": [
        {
          "name": "Allentown, PA"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/bankofamerica/relationship-banker-allentown-south-financial-center"
      },
      "company": {
        "id": 12145,
        "short_name": "bankofamerica",
        "name": "Bank of America"
      }
    },
    {
      "contents": "<p><strong>Art der Anstellung:</strong> Befristet; max. 15-20 h/Woche<br> <br><strong>In Richtung Zukunft? Bitte einsteigen. </strong><br><br>Wie werden wir in Zukunft miteinander kommunizieren, Energien sinnvoll nutzen und uns fortbewegen? Wir können an den Antworten zusammenarbeiten. Wir suchen dafür kluge Köpfe, die Theorien in die Praxis umwandeln und clever mitdenken.<br><br>Als Werkstudent*in stehen dir bei uns viele Türen offen, um dich einzubringen: Ergreife jetzt die Chance und werde Teil unseres globalen Netzwerks, knüpfe wichtige Kontakte und lege so den Grundstein für deine berufliche und persönliche Zukunft. Wir freuen uns, wenn du dein Talent bei uns einbringen willst!<br> <br><strong>Wir setzen um, worauf es ankommt. Das ist dein Beitrag.</strong><br><br><ul><li>Du willst endlich deine theoretischen Kenntnisse in der Praxis anwenden und das Tagesgeschäft einer modernen Personalabteilung kennen lernen?</li><li>Dann bist du genau richtig und unterstützt unser lokales People &amp; Organisation -Team im operativen Tagesgeschäft.</li><li>Du hilfst uns interne Prozesse proaktiv umzusetzen und zu treiben. Zusätzlich erhältst du spannende Einblicke in die operative Personalarbeit.</li><li>Außerdem wirkst du bei unseren Projekten mit und hilfst uns bei Datengewinnung und -analysen.</li></ul><br><strong>Was du können solltest. Damit die Welt mehr kann.</strong><br><br><ul><li>Dein Ticket zu uns ist dein Studium der Betriebswirtschaftslehre, Sozialwissenschaften, Rechtswissenschaften oder Ähnliches, gerne mit Schwerpunkt Personalwesen/Arbeitsrecht</li><li>Vielleicht hast du auch schon eine abgeschlossene Ausbildung oder erste Praxiserfahrung in diesem Kontext</li><li>Im MS-Office-Paket macht dir keiner was vor und Du hast Spaß mit innovativen IT-Tools zu arbeiten</li><li>Du bist es gewohnt effizient, selbstständig und zügig zu arbeiten und behältst auch bei hohem Bearbeitungsvolumen einen klaren Kopf.</li><li>Zusammenarbeit im Team gibt dir Energie und macht dir Spaß</li><li>Deinen Arbeitsalltag meisterst du geschickt und diplomatisch auf Deutsch und hast an dich selbst einen hohen Qualitätsanspruch</li></ul><br><strong>Wir wollen, dass du willst: Bewirb dich!</strong><br><br><strong>www.siemens.de</strong> <br>wenn du vor deiner Bewerbung mehr über Siemens erfahren möchtest.<br><br>Du hast Fragen zur Bewerbung? <strong>Hier</strong> findest du Antworten auf häufig gestellte Fragen.<br><br>Wenn du darüber hinaus noch Fragen hast, wende dich gerne an uns:<br>www.siemens.de/fragenzurbewerbung<br><br><strong>www.siemens.de/karriere</strong><br>wenn du mehr Informationen zu Jobs &amp; Karriere bei Siemens erhalten möchtest.<br><br>Wir legen Wert auf Chancengleichheit und freuen uns über Bewerbungen von Menschen mit Behinderung.<br><br><b>Organization:</b> People &amp; Organization<br><br><b>Company:</b> Siemens AG<br><br><b>Experience Level:</b> Student (Not Yet Graduated)<br><br><b>Full / Part time:</b> Part-time</p>",
      "name": "Werkstudent*in (w/m/d) im Bereich Human Resources",
      "type": "external",
      "publication_date": "2023-06-02T23:42:52Z",
      "short_name": "werkstudentin-wmd-im-bereich-human-resources-836ccf",
      "model_type": "jobs",
      "id": 11489006,
      "locations": [
        {
          "name": "Erlangen, Germany"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/siemens/werkstudentin-wmd-im-bereich-human-resources-836ccf"
      },
      "company": {
        "id": 11913,
        "short_name": "siemens",
        "name": "Siemens"
      }
    },
    {
      "contents": "<p><strong>Now's ourtime to inspire the future of healthcare together.</strong><br><br>SiemensHealthineers is a leading global medical technology company with over 170 yearsof experience and 18,000 patents. More than 60,000 dedicatedcolleagues in over 70 countries are driven to shape the future of healthcare.We stand with our customers around the world to support them in delivering highquality care to their patients. An estimated 5 million patients across theglobe benefit every day from our innovative technologies and services inthe areas of diagnostic and therapeutic imaging, laboratory diagnostics andmolecular medicine, as well as digital health and enterprise services. This iswhat truly matters to us. <br><br>Join our team now atSiemens Healthineers as a <strong>Sr. Human Resources Business Consultant</strong>.  This role willpartner with and support our Ultrasound organization and other organizations assignedas needed.  The position holder must havea consultative capacity to coach and partner with the leadership team and todrive business strategy while being an advocate and expert in all HR functionsfor employees.  The position will bebased in Mountain View, California.  TheSr. Human Resources Business Consultant will have the ability to understand ourbusiness, our strategy and our mission to deliver integrated Human Resourcesmanagement services and programs across the organizations' approximately 600employees.<br><br><strong>This is a role well suited to anambitious professional, looking for the next step in their career. You will beresponsible for providing a </strong>full range ofhuman resources and operational support to our organization including:<br><br><ul> <li>Partner     with the organization by actively participating in managing the business     and integrating the human resources function with business activities to     provide value to the customer.</li> <li>Partner     with the organization in leading the talent management process, including     developmental reviews and organization planning to accelerate leadership     development and enhance technical expertise at all levels in the     organization.</li> <li>Partner     with the talent acquisition organization to develop and execute staffing     strategies to support achievement of the long-term goals of the business.</li> <li>Implement     employee relations strategies designed to create an environment that     drives maximum individual and team success and facilitate resolution of     employee relations issues.</li> <li>Counsel     managers and employees to ensure appropriate and consistent application of     Siemens Healthineers operating policies and procedures.</li> <li>Conduct     investigations and recommend corrective actions.</li> <li>Administer,     monitor, coordinate, maintain and ensure compliance with areas that may     include affirmative action, anti-discrimination, health and safety     programs as well as federal and state regulations.</li> <li>Facilitate     change management initiatives and partner with the leadership team to     effectively communicate business strategies, goals, values and performance     expectations.</li> <li>Conduct     or participate on special investigations, studies, projects and other HR     initiatives as needed to meet overall company and department strategic     goals and initiatives.</li> <li>15%     travel for organizational meetings; other travel may be required as needed.</li></ul><br><strong>This positionmay suit you best if you are familiar with </strong><strong>what is below, and would like to dodevelop your career with Healthineers</strong><br><br><ul><li>Experienceworking in a highly matrixed organization.</li><li>The abilityto be flexible, self-directed, motivated and able to interact with employees atall levels. </li><li>Strong oraland written communication. </li><li>Excellentinterpersonal and coaching skills.</li><li>The abilityto prioritize rapidly; strong problem-solving skills; excellent decisionmaking/analysis skills; ability to manage multiple projects simultaneously.</li><li>Must possessabove average proficiency in Microsoft Office (Work, Excel, Outlook,PowerPoint).</li><li>The abilityto use data and information to make recommendations to effectively resolveproblems or issues by using judgment that is consistent with standard,practices, policies, procedures, regulations or government law. </li><li>The abilityto objectively coach employees and management through routine and complex employeerelations matters.</li></ul><br><strong>Required skills to have for the success of this role</strong><br><br><ul><li>Bachelor'sDegree required. Master's Degree in Human Resources, Business Administration orOrganizational Development a plus.</li><li>A minimum ofeight years of human resources generalist experience demonstrating an in-depthknowledge of multiple human resources disciplines including employee relations,performance management, and management consultation.</li><li>PHR/SPHRcertification is preferred.</li></ul><br>The pay range for this position is <strong>$138,320 - $165,000</strong>annually; however, base pay offered may vary depending on job-relatedknowledge, skills, and experience. The annual incentive target is 10% of basepay.  Siemens Healthineers offers avariety of health and wellness benefits including paid time off and holidaypay.   Details regarding our benefits can be found here<strong>: </strong><strong>https://benefitsatshs.com/index.html</strong><br><br>This information is provided per the required state EqualPay Act. Base pay information is based on market location. Applicants shouldapply via Siemens Healthineers external or internal careers site.<br><br>AtSiemens Healthineers, we value those who dedicate their energy and passion to agreater cause. Our people make us unique as an employer in the med-techindustry. What unites and motivates our global team is the inspiration of ourcommon purpose:  To innovate forhealthcare, building on our remarkable legacy of pioneering ideas that translateinto even better healthcare products and services. We recognize that takingownership of our work allows both us and the company to grow. We offer you aflexible and dynamic environment and the space to move beyond your comfort zoneto grow both personally and professionally.<br><br><strong>Beware of Job Scams</strong><br><br>Pleasebeware of potentially fraudulent job postings or suspicious recruiting activityby persons that are currently posing as Siemens Healthineersrecruiters/employees. These scammers may attempt to collect your confidentialpersonal or financial information. If you are concerned that an offer ofemployment with Siemens Healthineers might be a scam or that the recruiter isnot legitimate, please verify by searching for the posting on the SiemensHealthineers Career Site.<br><br><strong>If you want to join us in transforming the way healthcareis delivered, visit our career site at </strong>https://usa.healthcare.siemens.com/careers<strong>. </strong><br><br>Ifyou wish to find out more about the specific before applying, please visit: https://usa.healthcare.siemens.com/about.<br><br>Asan equal-opportunity employer we are happy to consider applications fromindividuals with disabilities.<br><br>#LI-BH1<br><br><b>Organization:</b> Siemens Healthineers<br><br><b>Company:</b> Siemens Medical Solutions USA, Inc.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time<br><br><b>Equal Employment Opportunity Statement</b><br>Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability unrelated to ability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, order of protection status, protected veteran or military status, or an unfavorable discharge from military service, and other categories protected by federal, state or local law.<br><br><b>EEO is the Law</b><br>Applicants and employees are protected under Federal law from discrimination. To learn more, Click here.<br><br><b>Pay Transparency Non-Discrimination Provision</b><br>Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here.<br><br><b>California Privacy Notice</b><br>California residents have the right to receive additional notices about their personal information. To learn more, click here.</p>",
      "name": "Sr. Human Resources Business Consultant",
      "type": "external",
      "publication_date": "2023-04-21T23:38:48Z",
      "short_name": "sr-human-resources-business-consultant-bb6095",
      "model_type": "jobs",
      "id": 11082470,
      "locations": [
        {
          "name": "Palo Alto, CA"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/siemens/sr-human-resources-business-consultant-bb6095"
      },
      "company": {
        "id": 11913,
        "short_name": "siemens",
        "name": "Siemens"
      }
    },
    {
      "contents": "<p><b>Job Description:</b><br><br>At Bank of America, we are guided by a common purpose to help make financial lives better through the power of every connection. Responsible Growth is how we run our company and how we deliver for our clients, teammates, communities and shareholders every day.<br><br>One of the keys to driving Responsible Growth is being a great place to work for our teammates around the world. We're devoted to being a diverse and inclusive workplace for everyone. We hire individuals with a broad range of backgrounds and experiences and invest heavily in our teammates and their families by offering competitive benefits to support their physical, emotional, and financial well-being.<br><br>Bank of America believes both in the importance of working together and offering flexibility to our employees. We use a multi-faceted approach for flexibility, depending on the various roles in our organization.<br><br>Working at Bank of America will give you a great career with opportunities to learn, grow and make an impact, along with the power to make a difference. Join us!<br><br>Job Description:<br>This role is responsible for engaging clients in the lobby to educate and assist with conducting transactions through self-service resources such as mobile banking, online banking, or ATM. This role also accurately and efficiently processes cash transactions for clients as needed. Relationship bankers have deep conversations with clients to gain in-depth knowledge of their financial and life priorities.<br><br>A Relationship Banker (responsibilities):<br>•  Executes the bank's risk culture and strives for operational excellence<br>•  Builds relationships with individual clients to meet their financial needs<br>•  Follows established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations<br>•  Grows business knowledge and network by partnering with experts in small business, lending and investments<br>•  Manages financial center traffic, appointments and outbound calls effectively<br>•  Drives the client experience<br>•  Manages cash responsibilities<br><br>You're a person who (required skills):<br>•  Is an enthusiastic, highly motivated self-starter with a strong work ethic and intense focus on results, acting in the best interest of the client.<br>•  Collaborates effectively to get things done, building and nurturing strong relationships.<br>•  Displays passion, commitment and drive to deliver an experience that improves our clients' financial lives.<br>•  Is confident in identifying solutions for new and existing clients based on their needs.<br>•  Communicates effectively and confidently, and is comfortable engaging all clients.<br>•  Has the ability to learn and adapt to new information and technology platforms.<br>•  Is confident in educating clients on how to conduct simple banking transactions through self-service technologies (for example, ATM, online banking, mobile banking).<br>•  Applies strong critical thinking and problem-solving skills to meet clients' needs.<br>•  Will follow established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations.<br>•  Efficiently manages your time and capacity.<br>•  Focuses on results, while acting in the best interest of the client.<br>•  Can be flexible to work weekends and/or extended hours as needed.<br><br>You'll be more prepared if you have (desired skills):<br>•  Experience in financial services and knowledge of financial services industry, products and solutions.<br>•  One year of demonstrated successful sales experience in a salary plus incentive environment with individual sales goals.<br>•  Six months of cash handling experience.<br>•  Bachelor's degree or business relevant associate degree such as business management, business administration, or finance.<br><br><b><strong><em> Bilingual Spanish Preferred </em></strong></b><br><br>Skills Used in this Role:<br>•  Customer Service<br>•  Risk Management<br>•  Consumer Products and Solutions<br>•  Overcoming Objections<br>•  Risk Management<br>•  Cash Management<br>•  Demonstrating Technology<br>•  Relationship Management<br>•  Active Listening<br>•  Learning Agility<br>•  Problem Solving<br>•  Critical Thinking<br>•  Multitasking<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>",
      "name": "Relationship Banker - East Riverdale Financial Center",
      "type": "external",
      "publication_date": "2023-12-05T23:25:34Z",
      "short_name": "relationship-banker-east-riverdale-financial-center-99be6e",
      "model_type": "jobs",
      "id": 13304546,
      "locations": [
        {
          "name": "Hyattsville, MD"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/bankofamerica/relationship-banker-east-riverdale-financial-center-99be6e"
      },
      "company": {
        "id": 12145,
        "short_name": "bankofamerica",
        "name": "Bank of America"
      }
    },
    {
      "contents": "<p>Ben je op zoek naar een leerrijke, inspirerende en uitdagende stageplaats binnen het domein van HR Marketing &amp; Recruitment? Dan ben je aan het juiste adres!<br><br>Om het huidige recruitment team te ondersteunen, zijn we op zoek naar een <strong>Stagiair HR Marketing &amp; </strong><strong>Recruitment</strong><strong> (m/v</strong><strong>/x</strong><strong>)</strong><strong>.</strong><br><br>Wat is je uitdaging?<br><br>Je maakt deel uit van het rekruteringsteam van Siemens België dat bestaat uit 5 personen. Na een opleiding in onze tools en processen ondersteun je het team bij hun dagelijkse taken. De taken omvatten onder andere:<br><br><ul><li>Het opstellen en publiceren van de <strong>vacatures</strong>, <strong>screening</strong> van cv's, analyse van <strong>psychotechnische testen</strong>.</li><li>Nieuwe contacten leggen met potentiële kandidaten d.m.v. van actieve benadering op <strong>sociale media</strong>.</li><li>Afhankelijk van jouw interesses, kan je ook ondersteuning bieden bij volgende projecten: <strong>Employer Branding, HR Marketing, Young Graduate Program</strong> enz.</li></ul><br>Wie ben jij?<br><br><ul><li>Je volgt een hogere opleiding in Human Resources, Psychologie, Marketing, Communicatie of andere. Je bent op zoek naar een stage voor een minimumduur van 300 uren en beschikt over een stagecontract via jouw school.</li><li>Je hebt een <strong>goede beheersing van Microsoft Office</strong> en hebt interesse om met nieuwe tools te leren werken. </li><li>Je houdt ervan om <strong>samen te werken</strong> en jouw steentje bij te dragen aan de groepssfeer.</li><li>Je hebt een zeer goede kennis van het Nederlands. Kennis van het Engels en/of het Frans is een pluspunt. </li><li>Tot slot stel je je <strong>positivisme, nieuwsgierigheid, luisterbereidheid</strong> en<strong> flexibiliteit</strong> ten dienste van een dynamisch en geëngageerd team. </li></ul><br>Wat je bij Siemens kan verwachten:<br><br><ul><li>Een <strong>leuke en motiverende werksfeer</strong> binnen een hecht team.</li><li>Je werkt voornamelijk op afstand met de mogelijkheid om naar kantoor te komen.</li><li>Je kan rekenen op de nodige <strong>coaching en vertrouwen</strong>.</li><li>Je krijgt de kans om als volwaardig lid van ons team veel bij te leren op een korte tijd en jouw <strong>theoretische kennis om te zetten in de praktijk</strong>.</li></ul><br>Zin om dit avontuur aan te gaan? <strong>Solliciteer dan nu!</strong><br><br><b>Organization:</b> People &amp; Organization<br><br><b>Company:</b> Siemens S.A./N.V.<br><br><b>Experience Level:</b> Student (Not Yet Graduated)<br><br><b>Full / Part time:</b> Full-time</p>",
      "name": "Stage HR Marketing & Recruitment (m/v/x)",
      "type": "external",
      "publication_date": "2023-03-01T23:50:33Z",
      "short_name": "stage-hr-marketing-recruitment-mvx",
      "model_type": "jobs",
      "id": 10953447,
      "locations": [
        {
          "name": "Brussels, Belgium"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/siemens/stage-hr-marketing-recruitment-mvx"
      },
      "company": {
        "id": 11913,
        "short_name": "siemens",
        "name": "Siemens"
      }
    },
    {
      "contents": "<p><b>Job Description:</b><br><br>At Bank of America, we are guided by a common purpose to help make financial lives better through the power of every connection. Responsible Growth is how we run our company and how we deliver for our clients, teammates, communities and shareholders every day.<br><br>One of the keys to driving Responsible Growth is being a great place to work for our teammates around the world. We're devoted to being a diverse and inclusive workplace for everyone. We hire individuals with a broad range of backgrounds and experiences and invest heavily in our teammates and their families by offering competitive benefits to support their physical, emotional, and financial well-being.<br><br>Bank of America believes both in the importance of working together and offering flexibility to our employees. We use a multi-faceted approach for flexibility, depending on the various roles in our organization.<br><br>Working at Bank of America will give you a great career with opportunities to learn, grow and make an impact, along with the power to make a difference. Join us!<br><br>Job Description:<br>This role is responsible for engaging clients in the lobby to educate and assist with conducting transactions through self-service resources such as mobile banking, online banking, or ATM. This role also accurately and efficiently processes cash transactions for clients as needed. Relationship bankers have deep conversations with clients to gain in-depth knowledge of their financial and life priorities.<br><br>A Relationship Banker (responsibilities):<br>•  Executes the bank's risk culture and strives for operational excellence<br>•  Builds relationships with individual clients to meet their financial needs<br>•  Follows established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations<br>•  Grows business knowledge and network by partnering with experts in small business, lending and investments<br>•  Manages financial center traffic, appointments and outbound calls effectively<br>•  Drives the client experience<br>•  Manages cash responsibilities<br><br>You're a person who (required skills):<br>•  Is an enthusiastic, highly motivated self-starter with a strong work ethic and intense focus on results, acting in the best interest of the client.<br>•  Collaborates effectively to get things done, building and nurturing strong relationships.<br>•  Displays passion, commitment and drive to deliver an experience that improves our clients' financial lives.<br>•  Is confident in identifying solutions for new and existing clients based on their needs.<br>•  Communicates effectively and confidently, and is comfortable engaging all clients.<br>•  Has the ability to learn and adapt to new information and technology platforms.<br>•  Is confident in educating clients on how to conduct simple banking transactions through self-service technologies (for example, ATM, online banking, mobile banking).<br>•  Applies strong critical thinking and problem-solving skills to meet clients' needs.<br>•  Will follow established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations.<br>•  Efficiently manages your time and capacity.<br>•  Focuses on results, while acting in the best interest of the client.<br>•  Can be flexible to work weekends and/or extended hours as needed.<br><br>You'll be more prepared if you have (desired skills):<br>•  Experience in financial services and knowledge of financial services industry, products and solutions.<br>•  One year of demonstrated successful sales experience in a salary plus incentive environment with individual sales goals.<br>•  Six months of cash handling experience.<br>•  Bachelor's degree or business relevant associate degree such as business management, business administration, or finance.<br><br>Skills Used in this Role:<br>•  Customer Service<br>•  Risk Management<br>•  Consumer Products and Solutions<br>•  Overcoming Objections<br>•  Risk Management<br>•  Cash Management<br>•  Demonstrating Technology<br>•  Relationship Management<br>•  Active Listening<br>•  Learning Agility<br>•  Problem Solving<br>•  Critical Thinking<br>•  Multitasking<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>",
      "name": "Relationship Banker",
      "type": "external",
      "publication_date": "2023-12-05T23:25:34Z",
      "short_name": "relationship-banker-f9fc90",
      "model_type": "jobs",
      "id": 13304438,
      "locations": [
        {
          "name": "Pine Bluff, AR"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/bankofamerica/relationship-banker-f9fc90"
      },
      "company": {
        "id": 12145,
        "short_name": "bankofamerica",
        "name": "Bank of America"
      }
    },
    {
      "contents": "<p><b>Job Description:</b><br><br>At Bank of America, we are guided by a common purpose to help make financial lives better through the power of every connection. Responsible Growth is how we run our company and how we deliver for our clients, teammates, communities and shareholders every day.<br><br>One of the keys to driving Responsible Growth is being a great place to work for our teammates around the world. We're devoted to being a diverse and inclusive workplace for everyone. We hire individuals with a broad range of backgrounds and experiences and invest heavily in our teammates and their families by offering competitive benefits to support their physical, emotional, and financial well-being.<br><br>Bank of America believes both in the importance of working together and offering flexibility to our employees. We use a multi-faceted approach for flexibility, depending on the various roles in our organization.<br><br>Working at Bank of America will give you a great career with opportunities to learn, grow and make an impact, along with the power to make a difference. Join us!<br><br>Job Description:<br>This role is responsible for complex operational processes and quality assurance supporting the wealth management business. Key responsibilities include end-to-end ownership of issue resolution, potentially working across multiple operations and/or product specialists, and ensuring procedures are clearly documented and up to date. This role also may support projects/initiatives and/or prepare executive-level reports and presentations. Individuals should have deep subject matter expertise and experience across wealth management and/or operations functions.<br><br>Responsibilities:<br>•  Leads end-to-end resolution of complex client issues and inquiries, including research, escalation and approvals for items with high levels of monetary risk<br>•  Drives execution of complex financial and/or non-financial client transactions<br>•  Supports process improvements, requirements, and initiatives across multiple stakeholders<br>•  Performs quality assurance reviews, testing and training to ensures high performance accuracy of performance metrics and quality standards<br>•  Supports risk management and audit processes, including identification of issues, development of mitigation strategies, and exam preparation<br>•  Reviews and updates procedures as needed to ensure they are accurate and up-to-date<br>•  Supports operational team projects and production of executive-level reports and presentations for senior management as needed<br><br>Skills:<br>•  Oral Communication<br>•  Written Communication<br>•  Critical Thinking<br>•  Data Analysis<br>•  Research<br>•  Problem Solving<br>•  Multitasking<br>•  Collaborating<br>•  Learning Agility<br>•  Presentation Skills<br>•  Project Management<br>•  Risk Management<br>•  Microsoft Excel<br>•  Microsoft Outlook<br>•  Investment Products and Solutions<br><br>Required Skills: <br><br>Leads end-to-end resolution of complex client issues and inquiries, including research, escalation and approvals for items with high levels of monetary risk<br><br>Drives execution of complex financial and/or non-financial client transactions<br><br>Supports process improvements, requirements, and initiatives across multiple stakeholders<br><br>Performs quality assurance reviews, testing and training to ensures high performance accuracy of performance metrics and quality standards<br><br>Supports risk management and audit processes, including identification of issues, development of mitigation strategies, and exam preparation<br><br>Reviews and updates procedures as needed to ensure they are accurate and up-to-date<br><br>Supports operational team projects and production of executive-level reports and presentations for senior management as needed<br><br>Desired Skills:<br><br>Experience with investment products a plus<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>",
      "name": "GWIM Operations Consultant - Fund Performance Operations",
      "type": "external",
      "publication_date": "2023-12-12T23:39:29Z",
      "short_name": "gwim-operations-consultant-fund-performance-operations",
      "model_type": "jobs",
      "id": 13394921,
      "locations": [
        {
          "name": "Jacksonville, FL"
        },
        {
          "name": "Pennington, NJ"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/bankofamerica/gwim-operations-consultant-fund-performance-operations"
      },
      "company": {
        "id": 12145,
        "short_name": "bankofamerica",
        "name": "Bank of America"
      }
    },
    {
      "contents": "<p><strong>This is Adyen</strong></p>\n\n<p><span>Adyen provides payments, data, and financial products in a single solution for customers like Meta, Uber, H&amp;M, and Microsoft - making us the financial technology platform of choice. At Adyen, everything we do is engineered for ambition. </span></p>\n\n<p><span>For our teams, we create an environment with opportunities for our people to succeed, backed by the culture and support to ensure they are enabled to truly own their careers. We are motivated individuals who tackle unique technical challenges at scale and solve them as a team. Together, we deliver innovative and ethical solutions that help businesses achieve their ambitions faster.</span></p>\n\n<p><strong>HR Business Partner </strong></p>\n\n<p>Adyen is looking for an HR Business Partner to contribute to the growth and scale of our teams across Asia Pacific, where we have teams based across 7 geographies.  This role will be supporting Tech/Product teams as well as teams across our Commercial and Staff groups.  In this role, you will be working with managers, leaders and employees in all people programs such as (but not limited to) talent development, employee engagement and performance management. You will work closely with leaders to complement them, challenge and coach them on best practices.  You will help them develop and support the execution of people strategies to ensure we are creating the best experience for our people.</p>\n\n<p><strong>What you’ll do:</strong></p>\n\n<ul>\n<li>Be an effective sparring partner for team leads on all things related to people including team growth and development </li>\n<li>On an ongoing basis, coach team leads to develop themselves and their teams by regularly discussing how to increase their teams’ impact as we continue to grow and scale</li>\n<li>Facilitate talent planning that produces actionable strategies including plans for talent acquisition, team development and growth of future leaders</li>\n<li>Support Team Leads and Adyeners with Employee Relations support as necessary</li>\n<li>Collaborate with global, cross-functional HR Centers of Expertise to develop, enhance and launch initiatives that meet the evolving needs of our business</li>\n<li>Leverage data to identify and act on opportunities that point to better ways of doing things as we scale</li>\n<li>Call into question when needed on manager thinking and partner with them to make decisions for the good of the whole business</li>\n<li>Advocate for all Adyeners as they learn and develop through rapid growth in a high-performance environment</li>\n<li>Guide managers to apply the Adyen formula in their day-to-day decisions</li>\n<li>Foster an environment rich in diversity, equity and inclusion</li>\n<li>Partner with the HR Innovations team to get things done in a timely manner and provide our employees a seamless employment experience</li>\n</ul>\n\n<p><strong>Who you are:</strong></p>\n\n<ul>\n<li>You’ve got at least <strong>8+ years’ experience</strong> working with managers and leaders at all levels as a <strong>business partner role</strong> at a high-pace company</li>\n<li>You have supported Tech and/or Product teams before</li>\n<li>You have a strong sense of self and build trust quickly to become a trusted business advisor at all levels of the organization</li>\n<li>You are able to question the status quo with managers and work with them to define new solutions to old problems</li>\n<li>You are well versed in organizational dynamics, know what healthy, motivated, growing teams look like, and can give guidance on what to do to make this even better;</li>\n<li>You’re hands-on, but know how to collaborate and prioritize (constantly looking for how things can be done more simply or automated)</li>\n<li>You’re excited to try new approaches, do things differently, and aren’t afraid to “build as you go”</li>\n<li>You’re a change agent who thrives in a fast paced environment and can effectively engage those around you to get them excited about the future</li>\n</ul>\n\n<p><strong>Our Diversity, Equity and Inclusion commitments </strong></p>\n\n<p><span>Our unique approach is a product of our diverse perspectives. This diversity of backgrounds and cultures is essential in helping us maintain our momentum. Our business and technical challenges are unique, and we need as many different voices as possible to join us in solving them - voices like yours. No matter who you are or where you’re from, we welcome you to be your true self at Adyen. </span></p>\n\n<p><span>Studies show that women and members of underrepresented communities apply for jobs only if they meet 100% of the qualifications. Does this sound like you? If so, Adyen encourages you to reconsider and apply. We look forward to your application!</span></p>\n\n<p><strong>What’s next?</strong></p>\n\n<p><span>Ensuring a smooth and enjoyable candidate experience is critical for us. We aim to get back to you regarding your application within 5 business days. Our interview process tends to take about 4 weeks to complete, but may fluctuate depending on the role. </span><a href=\"https://careers.adyen.com/how-we-hire\"><span>Learn more about our hiring process here</span></a><span>. Don’t be afraid to let us know if you need more flexibility.</span></p>\n\n<p>This role is based out of our Singapore office. We are an office-first company and value in-person collaboration; we do not offer remote-only roles.</p>\n\n<p> </p>",
      "name": "HR Business Partner",
      "type": "external",
      "publication_date": "2023-10-06T10:09:28Z",
      "short_name": "hr-business-partner",
      "model_type": "jobs",
      "id": 12101664,
      "locations": [
        {
          "name": "Singapore"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/adyen/hr-business-partner"
      },
      "company": {
        "id": 15000210,
        "short_name": "adyen",
        "name": "Adyen"
      }
    },
    {
      "contents": "<p><b>Job Description:</b><br><br>At Bank of America, we are guided by a common purpose to help make financial lives better through the power of every connection.  Responsible Growth is how we run our company and how we deliver for our clients, teammates, communities and shareholders every day. One of the keys to driving Responsible Growth is being a great place to work for our teammates around the world. We're devoted to being a diverse and inclusive workplace for everyone. We hire individuals with a broad range of backgrounds and experiences and invest heavily in our teammates and their families by offering competitive benefits to support their physical, emotional, and financial well-being.<br><br>Bank of America believes both in the importance of working together and offering flexibility to our employees. We use a multi-faceted approach for flexibility, depending on the various roles in our organization.<br><br>Working at Bank of America will give you a great career with opportunities to learn, grow and make an impact, along with the power to make a difference.  Join us!<br><br>Job Description:<br><br>We have an exciting opportunity for a Process Design Consultant to join our Process and Operational Excellence organization part of the Global Credit, AML and Onboarding Operations (GCAOO). <br><br>The Process Design Consultant supports Single Process Inventory (SPI) governance and oversight routines, across the GCAOO organization. Partnering with business function leaders, operations Process Owners and subject matter experts (SMEs) to provide an end to-end view of their processes, analyze impacts and data, and contribute to the optimization of the organization through continuous improvement and process reengineering.  We are looking for a strong contributor with the right level of experience, has excellent analytical and critical thinking skills, and a process improvement mind-set. Acts as an ambassador of the risk culture. Incumbents typically have 3-5 years of risk management, Global Banking and Global Markets, Global Credit and Loan Servicing Operation, or AML experience.<br><br>The candidate will engage with Process Owners and support partners on a regular basis ensuring that the SPI framework is adequate for all uses within GCAOO and Global Operations (GO).  They will also be engaged in process owner SPI advisory activities and ensuring the right framework is implemented to support continuous improvement activities with proper process attestation and ensuring appropriate linkage to overarching strategies and transformation activities.  The ideal candidate will have a passion for process governance and oversight and will develop close working relationships with the operations, strategy, and technology teams along with process owners and process engineers and Operational Excellence team, building trust and confidence at all levels.<br> <br>We are looking for a strong team contributor with the right experience, ability to challenge and influence stakeholders throughout the organization, and with excellent analytical and critical thinking skills.<br><br><b>Key responsibilities include the following:</b><br><br>•  Provides assistance to GCAOO Process Owners based on thorough understanding of impacts from change management, idea management, process performance, audit exams &amp; assessments to proactively influence process improvements while maintaining compliance to policy and procedures. <br>•  Ensure the appropriate level of Process Owner engagement and education around the Process Owner Portal (POP) including maintenance, and applicable risks and controls. <br>•  Support or lead the implementation of various special projects designed to further mitigate risks and drive SPI governance within GCAOO.<br>•  Ensure Process Management Policy adherence and, document and analyze current/target state business processes<br>•  Support Process Owner deliverables <br>•  Provide end-to-end view of processes within business functions with proper identification of hand-offs and process connectors<br>•  Support the program's short-and-long term strategy<br><br><b>Requirements:</b><br><br>•   Understanding of AML requirements and Enterprise Standards<br>•   Ability to navigate end to end processes <br>•   Understanding of process governance <br>•   Must have desire and ability to learn processes, new technology tools and applications<br>•   Proven track record of delivering results<br>•   Ability to challenge and influence process owners <br>•   Experience in analyzing data, operational models, and process maps<br>•   Strong communication skills and \"how\" competencies to effectively work with process owners, process designers, operational excellence team and business partners<br><br>•   Proficient in Microsoft Office applications, including intermediate Excel, Visio, Power Point, SharePoint and WebEx skills<br><br><b>Other Qualifications/Desired Skills:</b><br><br>•   Bachelor's degree in related field or equivalent experience<br>•   ORCIT / Key Measures / Process Owner Portal experience<br>•   Working knowledge of Risk Framework<br>•   Prior experience in AML processes desirable<br>•   Believes in value of diversity so we can reflect, connect, and meet the diverse needs of our clients and employees around the world<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>",
      "name": "Operational Excellence and Process Design Consultant - GCAOO",
      "type": "external",
      "publication_date": "2023-12-19T23:45:13Z",
      "short_name": "operational-excellence-and-process-design-consultant-gcaoo",
      "model_type": "jobs",
      "id": 13514453,
      "locations": [
        {
          "name": "Charlotte, NC"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/bankofamerica/operational-excellence-and-process-design-consultant-gcaoo"
      },
      "company": {
        "id": 12145,
        "short_name": "bankofamerica",
        "name": "Bank of America"
      }
    },
    {
      "contents": "<p><b>Job Description:</b><br><br>At Bank of America, we are guided by a common purpose to help make financial lives better through the power of every connection. Responsible Growth is how we run our company and how we deliver for our clients, teammates, communities and shareholders every day.<br><br>One of the keys to driving Responsible Growth is being a great place to work for our teammates around the world. We're devoted to being a diverse and inclusive workplace for everyone. We hire individuals with a broad range of backgrounds and experiences and invest heavily in our teammates and their families by offering competitive benefits to support their physical, emotional, and financial well-being.<br><br>Bank of America believes both in the importance of working together and offering flexibility to our employees. We use a multi-faceted approach for flexibility, depending on the various roles in our organization.<br><br>Working at Bank of America will give you a great career with opportunities to learn, grow and make an impact, along with the power to make a difference. Join us!<br><br>Job Description:<br>This role is responsible for engaging clients in the lobby to educate and assist with conducting transactions through self-service resources such as mobile banking, online banking, or ATM. This role also accurately and efficiently processes cash transactions for clients as needed. Relationship bankers have deep conversations with clients to gain in-depth knowledge of their financial and life priorities.<br><br>A Relationship Banker (responsibilities):<br>•  Executes the bank's risk culture and strives for operational excellence<br>•  Builds relationships with individual clients to meet their financial needs<br>•  Follows established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations<br>•  Grows business knowledge and network by partnering with experts in small business, lending and investments<br>•  Manages financial center traffic, appointments and outbound calls effectively<br>•  Drives the client experience<br>•  Manages cash responsibilities<br><br>You're a person who (required skills):<br>•  Is an enthusiastic, highly motivated self-starter with a strong work ethic and intense focus on results, acting in the best interest of the client.<br>•  Collaborates effectively to get things done, building and nurturing strong relationships.<br>•  Displays passion, commitment and drive to deliver an experience that improves our clients' financial lives.<br>•  Is confident in identifying solutions for new and existing clients based on their needs.<br>•  Communicates effectively and confidently, and is comfortable engaging all clients.<br>•  Has the ability to learn and adapt to new information and technology platforms.<br>•  Is confident in educating clients on how to conduct simple banking transactions through self-service technologies (for example, ATM, online banking, mobile banking).<br>•  Applies strong critical thinking and problem-solving skills to meet clients' needs.<br>•  Will follow established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations.<br>•  Efficiently manages your time and capacity.<br>•  Focuses on results, while acting in the best interest of the client.<br>•  Can be flexible to work weekends and/or extended hours as needed.<br><br>You'll be more prepared if you have (desired skills):<br>•  Experience in financial services and knowledge of financial services industry, products and solutions.<br>•  One year of demonstrated successful sales experience in a salary plus incentive environment with individual sales goals.<br>•  Six months of cash handling experience.<br>•  Bachelor's degree or business relevant associate degree such as business management, business administration, or finance.<br><br>Skills Used in this Role:<br>•  Customer Service<br>•  Risk Management<br>•  Consumer Products and Solutions<br>•  Overcoming Objections<br>•  Risk Management<br>•  Cash Management<br>•  Demonstrating Technology<br>•  Relationship Management<br>•  Active Listening<br>•  Learning Agility<br>•  Problem Solving<br>•  Critical Thinking<br>•  Multitasking<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>",
      "name": "Relationship Banker - Hingham, MA",
      "type": "external",
      "publication_date": "2023-12-12T23:39:29Z",
      "short_name": "relationship-banker-hingham-ma-0eb9a7",
      "model_type": "jobs",
      "id": 13394969,
      "locations": [
        {
          "name": "Hingham, MA"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/bankofamerica/relationship-banker-hingham-ma-0eb9a7"
      },
      "company": {
        "id": 12145,
        "short_name": "bankofamerica",
        "name": "Bank of America"
      }
    },
    {
      "contents": "<p><b>Job Title</b><br>Assembler I<br><br><b>Job Description</b><br><br>As an Assmebler I, you will prepare and produce different types of products using different machines/tools according to instructions/drawings .  Activities can be repetitive .Will be trained on setting/adjusting machine (parts) using simple manual tools. Uses measuring tools to visually control the manufactured products. <b>This is a 3rd Shift position: 10:45pm to 6:45am Sunday through Thursday </b><br><br><b> Your role: </b><ul><li> Handle small, delicate parts with a high degree of accuracy. Must be able to assemble these parts repeatedly and for long periods using a microscope. </li><li> Perform a variety of electro-mechanical assembly operations using small hand tools, soldering equipment and machinery </li><li> Follow methods of sequence of operations to ensure documented &amp; controlled processes are followed. </li><li> Conduct inspection of incoming materials and outgoing finished goods using a microscope </li><li> Report on cell performances in standup meetings </li><li> Must be able to understand &amp; document daily production metrics accurately </li><li> May participate in projects as a team member in the development of skills, talents, and teamwork to support improvement projects. </li><li> Expected to demonstrate the Philips Behaviors, treat all team members with respect, and value their feedback </li></ul><b> You're the right fit if: </b><ul><li> High-school diploma or equivalent required </li><li> Must have good hand eye coordination while using a microscope </li><li> Must be able to sit or stand at a workbench for extended periods of time and complete work using a microscope </li><li> Have good communication skills with the ability to follow both verbal and written instructions. </li><li> Capability to use a computer and enter accurate data.  Having Microsoft office experience is a plus </li><li> • Must be flexible to the changing needs of the department &amp; business and will work overtime as needed </li><li>   You must be able to successfully perform the following minimum Physical, Cognitive and Environmental job requirements with or without accommodation for this Production/Assembler position. </li></ul><b>About Philips</b><br><br>We are a health technology company. We built our entire company around the belief that every human matters, and we won't stop until everybody everywhere has access to the quality healthcare that we all deserve. Do the work of your life to help improve the lives of others.<ul><li>Learn more about our business .</li><li>Discover our rich and exciting history. </li><li>Learn more about our purpose. </li><li>Read more about our employee benefits .</li></ul>If you're interested in this role and have many, but not all, of the experiences needed, we encourage you to apply. You may still be the right candidate for this or other opportunities at Philips. Learn more about our commitment to diversity and inclusion here .<br><br>Philips is an Equal Employment and Opportunity Employer/Disabled/Veteran and maintains a drug-free workplace.</p>",
      "name": "Assembler I",
      "type": "external",
      "publication_date": "2023-12-16T12:45:48Z",
      "short_name": "assembler-i-88df51",
      "model_type": "jobs",
      "id": 13492710,
      "locations": [
        {
          "name": "Reedsville, PA"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/philips/assembler-i-88df51"
      },
      "company": {
        "id": 1103,
        "short_name": "philips",
        "name": "Philips"
      }
    },
    {
      "contents": "<p><b>Job Description:</b><br><br>As a Advisor Development Program Financial Solutions Advisor Stage I (ADP FSA I), your journey begins obtaining your Securities Industry licenses, where you receive dedicated and personalized classes for your Securities Industry Essentials [SIE], Series 7 and Series 66 Exams. Once you obtain your licenses, you will be taught the foundational skills needed to be an advisor - from acquiring, building and managing client relationships to considering a client's complex financial picture and guiding them with advice and solutions to help them live their best financial lives, all while humanizing financial interactions. Once you have reached your key milestones, you will begin working in a financial center where you will help to deliver Bank of America's core banking, investment solutions and approach to client care. We will equip you with everything you need as you move through the stages of development.<br> <br>Once you have demonstrated success as a licensed ADP Financial Solutions Advisor Stage I, you will typically progress into the next role, ADP Financial Solutions Advisor Stage II, where you will continue to practice the skills you've learned by growing and deepening relationships within a portfolio of clients. As a successful ADP Financial Solutions Advisor Stage II, you will have the opportunity to advance in many roles within Bank of America and Merrill. The Academy will support you along the way with dedicated programs, tools and resources throughout your career journey.<br><br>This position is subject to SAFE Act registration requirements. Pursuant to the SAFE Act requirements, all employees engaged in residential loan mortgage originations must register with the federal registry system and remain in good standing. Since your position requires SAFE Act registration, you will be required to register and to submit to the required SAFE Act background check and registration process. Failure to obtain and/or maintain SAFE Act registration may result in your immediate termination.<br><br>Required skills:<br>•  Sets and accomplishes goals, achieving whatever you put your mind to.<br>•  Is comfortable in a sales role, finding ways to nurture strong relationships with prospective clients.<br>•  Communicates clearly and confidently with clients from all walks of life.<br>•  Works well with others and collaborates productively to get things done.<br>•  Can manage complexity, prioritize tasks and execute in a fast-paced environment.<br>•  Likes to learn on your feet, adapting to new information and seeking the right solutions for clients.<br>•  Efficiently manages your time and capacity.<br>•  Is thorough and will incorporate relevant regulatory due diligence into daily to-do's and long-term strategies for clients.<br><br>Desired skills:<br>•  Strong computer skills with an ability to multitask in a demanding environment.<br>•  A bachelor's degree, or 1-2 years' experience working in the financial service industry and/or a sales environment where goals were met or exceeded.<br>•  Experience assessing client needs, identifying/recommending solutions, and building/managing client relationships.<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>",
      "name": "Advisor Development Program - Financial Solutions Advisor Trainee - Jacksonville Financial Center - Phoenix, MD",
      "type": "external",
      "publication_date": "2023-12-01T23:21:34Z",
      "short_name": "advisor-development-program-financial-solutions-advisor-trainee-jacksonville-financial-center-phoenix-md",
      "model_type": "jobs",
      "id": 12576075,
      "locations": [
        {
          "name": "Hunt Valley, MD"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/bankofamerica/advisor-development-program-financial-solutions-advisor-trainee-jacksonville-financial-center-phoenix-md"
      },
      "company": {
        "id": 12145,
        "short_name": "bankofamerica",
        "name": "Bank of America"
      }
    },
    {
      "contents": "<p><strong>Hledáte uplatnění ve stabilní a perspektivní mezinárodní společnosti?</strong><br><br><strong>Rádi komunikujete?</strong><br><br><strong>Ovládáte angličtinu a němčinu?</strong><br><br><strong>Máte zájem o práci v oblasti služeb zákazníkům?</strong><br><br><strong>Pak hledáme právě Vás!</strong><br> <br><strong>Co by bylo náplní Vaší práce?</strong><br><br><ul><li>podpora zaměstnanců při práci s HR aplikacemi</li><li>zodpovídání dotazů uživatelů týkající se fungování HR procesů (hodnocení, nábor, rozvoj a vzdělávání zaměstnanců)</li><li>pomoc externím uchazečům s přihlašováním na volné pozice</li><li>e-mailová a telefonická komunikace v angličtině a němčině</li><li>analýza problémů týkající se správnosti dat, workflows, reportingu</li><li>vytváření školících materiálů a školení zaměstnanců</li><li>efektivní spolupráce v týmech v mezinárodním prostředí</li><li>správa uživatelů (oprávnění)</li></ul><br><strong>Na co se můžete těšit?</strong><br><br><ul><li>denní využití němčiny a angličtiny při komunikaci se zaměstnanci Siemens ze zemí EMEA a AM</li><li>porozumění funkčnosti HR aplikací a prohloubení znalostí v oblasti interních HR procesů</li><li>možnost osobního a profesního růstu v rámci společnosti po celém světě</li><li>přátelskou a neformální atmosféru v týmu</li></ul><br><strong>Co od Vás očekáváme?</strong><br><br><ul><li>SŠ/VŠ vzdělání</li><li>pokročilou znalost němčiny a angličtiny</li><li>pokročilou znalost balíčku MS Office</li><li>výborné komunikační dovednosti, prozákaznický přístup</li><li>min 1 rok zkušenosti na obdobné pozici (zákaznický servis)</li><li>zkušenosti s C-Ontact výhodou</li></ul><br><strong>A co Vám můžeme nabídnout?</strong><br><br><ul><li>5 týdnů dovolené (lze zakoupit až 8 dnů volna navíc z rozpočtu na benefity)</li><li>flexibilní pracovní doba s pevným jádrem od 10:00-14:00 hod.</li><li>home office s příspěvkem 100 Kč netto/den</li><li>roční bonus s možností převodu do cafeterie</li><li>e-stravenky v hodnotě 130 Kč/den</li><li>MultiSport karta za zvýhodněnou cenu</li><li>roční rozpočet do cafeterie ve výši min. 24 000 Kč s libovolným využitím na stránkách benefit-plus (např. dovolená, jazykový kurz, kulturní a sportovní akce, atd.)</li><li>možnosti profesního rozvoje, nabízíme širokou nabídku kurzů a školení</li><li>příspěvek na životní nebo penzijní pojištění hrazený z benefitů</li><li>firemní mateřské školky v Praze a v Ostravě</li><li>příležitost stát se akcionářem Siemens a získat akcie zdarma</li></ul><br>Více informací ke sdíleným službám GBS (Global Shared Services) naleznete zde: www.siemens.cz/gbs<br><br><b>Organization:</b> Global Business Services<br><br><b>Company:</b> Siemens, s.r.o.<br><br><b>Experience Level:</b> Mid-level Professional<br><br><b>Full / Part time:</b> Full-time</p>",
      "name": "Junior/Specialist/Senior Specialist HR Support Services",
      "type": "external",
      "publication_date": "2023-04-28T23:39:08Z",
      "short_name": "juniorspecialistsenior-specialist-hr-support-services-861355",
      "model_type": "jobs",
      "id": 11271674,
      "locations": [
        {
          "name": "Prague, Czech Republic"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Senior Level",
          "short_name": "senior"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/siemens/juniorspecialistsenior-specialist-hr-support-services-861355"
      },
      "company": {
        "id": 11913,
        "short_name": "siemens",
        "name": "Siemens"
      }
    },
    {
      "contents": "<p>HR Travel Specialist (Brasov &amp; Bucharest) will be responsible for handling employee queries, letters, system updates. In addition he / she will Perform and execute a defined range of administrative tasks related to daily, operational HR activities according to predetermined guidelines and procedures for (an) assigned organization(s).<br><br><strong>What part will you play?</strong><br><br><ul><li>To check and record in the applications the employees'  delegation statements and travel expenses claims;</li><li>Monitor compliance with travel policy;</li><li>Responsible for the correct transfer of information between SAP and True HR;</li><li>Archiving reports;</li><li>Support in case of audits and controls by authorities;</li><li>Explain mistakes to employees and help them to correct ;</li><li>Account reconciliations for employees</li><li>To make various reports for management;</li><li>Coordinate with the rest of the HR team.</li></ul><br><strong>What you need to make real what matters:</strong><br><br><ul><li>Basic accounting knowledge;</li><li>Minimum experience in the delegation area;</li><li>SAP, Excel, True HR;</li><li>Medium English;</li><li>Fequent interaction with employees, patience;</li><li>Attention to details;</li><li>Follow procedures and respect internal processes;</li><li>Team spirit;</li><li>Willingness to learn new things and ability to adapt quickly to new situations;</li><li>Ability to meet deadlines.</li></ul><br><strong>Make your mark in our exciting world as Siemens!</strong><br><br>Diversity at Siemens is our source of creativity and innovation. Having different types of talent and experiences makes us more results-oriented and better prepared to respond reliable to the demands of the Society. Therefore, we value the candidates that reflect the Diversity that we enjoy in our Company.<br><br><b>Organization:</b> Global Business Services<br><br><b>Company:</b> Siemens S.R.L.<br><br><b>Experience Level:</b> Experienced Professional<br><br><b>Full / Part time:</b> Full-time</p>",
      "name": "HR Travel & Expenses Specialist",
      "type": "external",
      "publication_date": "2023-04-21T23:38:48Z",
      "short_name": "hr-travel-expenses-specialist-4d1ec5",
      "model_type": "jobs",
      "id": 11104712,
      "locations": [
        {
          "name": "Bucharest, Romania"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/siemens/hr-travel-expenses-specialist-4d1ec5"
      },
      "company": {
        "id": 11913,
        "short_name": "siemens",
        "name": "Siemens"
      }
    },
    {
      "contents": "<p><b>Job Description:</b><br><br>At Bank of America, we are guided by a common purpose to help make financial lives better through the power of every connection. Responsible Growth is how we run our company and how we deliver for our clients, teammates, communities and shareholders every day.<br><br>One of the keys to driving Responsible Growth is being a great place to work for our teammates around the world. We're devoted to being a diverse and inclusive workplace for everyone. We hire individuals with a broad range of backgrounds and experiences and invest heavily in our teammates and their families by offering competitive benefits to support their physical, emotional, and financial well-being.<br><br>Bank of America believes both in the importance of working together and offering flexibility to our employees. We use a multi-faceted approach for flexibility, depending on the various roles in our organization.<br><br>Working at Bank of America will give you a great career with opportunities to learn, grow and make an impact, along with the power to make a difference. Join us!<br><br>Job Description:<br>This role is responsible for engaging clients in the lobby to educate and assist with conducting transactions through self-service resources such as mobile banking, online banking, or ATM. This role also accurately and efficiently processes cash transactions for clients as needed. Relationship bankers have deep conversations with clients to gain in-depth knowledge of their financial and life priorities.<br><br>A Relationship Banker (responsibilities):<br>•  Executes the bank's risk culture and strives for operational excellence<br>•  Builds relationships with individual clients to meet their financial needs<br>•  Follows established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations<br>•  Grows business knowledge and network by partnering with experts in small business, lending and investments<br>•  Manages financial center traffic, appointments and outbound calls effectively<br>•  Drives the client experience<br>•  Manages cash responsibilities<br><br>You're a person who (required skills):<br>•  Is an enthusiastic, highly motivated self-starter with a strong work ethic and intense focus on results, acting in the best interest of the client.<br>•  Collaborates effectively to get things done, building and nurturing strong relationships.<br>•  Displays passion, commitment and drive to deliver an experience that improves our clients' financial lives.<br>•  Is confident in identifying solutions for new and existing clients based on their needs.<br>•  Communicates effectively and confidently, and is comfortable engaging all clients.<br>•  Has the ability to learn and adapt to new information and technology platforms.<br>•  Is confident in educating clients on how to conduct simple banking transactions through self-service technologies (for example, ATM, online banking, mobile banking).<br>•  Applies strong critical thinking and problem-solving skills to meet clients' needs.<br>•  Will follow established processes and guidelines in daily activities to do what is right for clients and the bank, adhering to all applicable laws and regulations.<br>•  Efficiently manages your time and capacity.<br>•  Focuses on results, while acting in the best interest of the client.<br>•  Can be flexible to work weekends and/or extended hours as needed.<br><br>You'll be more prepared if you have (desired skills):<br>•  Experience in financial services and knowledge of financial services industry, products and solutions.<br>•  One year of demonstrated successful sales experience in a salary plus incentive environment with individual sales goals.<br>•  Six months of cash handling experience.<br>•  Bachelor's degree or business relevant associate degree such as business management, business administration, or finance.<br><br>Skills Used in this Role:<br>•  Customer Service<br>•  Risk Management<br>•  Consumer Products and Solutions<br>•  Overcoming Objections<br>•  Risk Management<br>•  Cash Management<br>•  Demonstrating Technology<br>•  Relationship Management<br>•  Active Listening<br>•  Learning Agility<br>•  Problem Solving<br>•  Critical Thinking<br>•  Multitasking<br><br><b>Shift:</b><br>1st shift (United States of America)<br><br><b>Hours Per Week: </b><br>40</p>",
      "name": "Relationship Banker - Brooklyn NY Area *Bilingual Spanish required",
      "type": "external",
      "publication_date": "2023-12-09T23:28:24Z",
      "short_name": "relationship-banker-brooklyn-ny-area-bilingual-spanish-required",
      "model_type": "jobs",
      "id": 13359338,
      "locations": [
        {
          "name": "New York, NY"
        }
      ],
      "categories": [
        {
          "name": "Human Resources and Recruitment"
        }
      ],
      "levels": [
        {
          "name": "Mid Level",
          "short_name": "mid"
        }
      ],
      "tags": [],
      "refs": {
        "landing_page": "https://www.themuse.com/jobs/bankofamerica/relationship-banker-brooklyn-ny-area-bilingual-spanish-required"
      },
      "company": {
        "id": 12145,
        "short_name": "bankofamerica",
        "name": "Bank of America"
      }
    }
  ],
  "aggregations": {}
}
